// @strict-types
#Область ПрограммныйИнтерфейс

// Тип правила конвертации по свойству конвертируемого объекта.
// 
// Параметры:
//  Свойство - СправочникСсылка.Свойства - Свойство объекта
// 
// Возвращаемое значение:
//  Строка - Тип правила конвертации по свойству, например
//    ПравилаКонвертацииОбъектов, ПравилаКонвертацииПредопределенныхДанных
Функция ТипПравилаКонвертацииПоСвойству(Свойство) Экспорт

	ТипПравилаКонвертации = "";

	ТипыСтрокой = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Свойство, "ТипыСтрокой");
	Если СтрНайти(НРег(ТипыСтрокой), НРег("ПеречислениеСсылка")) > 0 Тогда
		ТипПравилаКонвертации = "ПравилаКонвертацииПредопределенныхДанных";
	Иначе
		ТипПравилаКонвертации = "ПравилаКонвертацииОбъектов";
	КонецЕсли;

	Возврат ТипПравилаКонвертации;
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти