// @strict-types


#Область ПрограммныйИнтерфейс

// Тип правила конвертации по свойству.
// 
// Параметры:
//  Свойство - СправочникСсылка.Свойства - Свойство объекта
// 
// Возвращаемое значение:
//  Строка - Тип правила конвертации по свойству, например
//    ПравилаКонвертацииОбъектов, ПравилаКонвертацииПредопределенныхДанных
Функция ТипПравилаКонвертацииПоСвойству(Свойство) Экспорт
	
	ТипПравилаКонвертации = "";
	
	Если СтрНайти(НРег(Свойство.ТипыСтрокой), НРег("ПеречислениеСсылка")) > 0 Тогда
		ТипПравилаКонвертации = "ПравилаКонвертацииПредопределенныхДанных";
	Иначе
		ТипПравилаКонвертации = "ПравилаКонвертацииОбъектов";
	КонецЕсли;
	
	Возврат ТипПравилаКонвертации;
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
