#Область ОбработчикиСобытийФормы

&НаСервере
Процедура PEN007_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)

	ИмяСобытия = ИмяСобытия("PEN007_ПриСозданииНаСервереПосле");

	// Поле HTML - Алгоритм

	ПараметрыФормы = PEN007_МодификацияИнтерфейса.Интерфейс_ПараметрыФормы();

	ЭлементСтароеПолеКода = PEN007_МодификацияИнтерфейса.ЭлементФормы(ЭтотОбъект, "Алгоритм");
	Если ЭлементСтароеПолеКода = Неопределено Тогда
		Комментарий = "Не удалось найти элемент для хранения кода, которое должно быть определено в типовом решении
					  |Модификация формы приостановлена.";
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,
			ОбъектМетаданных(), Объект.Ссылка, Комментарий);
		Возврат;
	КонецЕсли;

	ЭлементПеред = PEN007_МодификацияИнтерфейса.ЭлементФормы(ЭтотОбъект, "ГруппаТеги");
	Если ЭлементПеред = Неопределено Тогда
		Комментарий = "Не удалось найти элемент, перед которым требуется добавить поле HTML
					  |Модификация формы приостановлена.";
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,
			ОбъектМетаданных(), Объект.Ссылка, Комментарий);
		Возврат;
	КонецЕсли;

	ПараметрыФормы.ЭлементПеред = ЭлементПеред;
	ПараметрыФормы.ЭлементГруппа = Неопределено; // Поле кода находится в корне дерева элементов
	ПараметрыФормы.ЭлементИмя = PEN007_МодификацияИнтерфейса.ЭлементИмя(ЭлементСтароеПолеКода.Имя);
	ПараметрыФормы.ЭлементЗаголовок = ЭлементСтароеПолеКода.Заголовок;

	PEN007_МодификацияИнтерфейса.ДобавитьЭлементПолеHTML(ЭтотОбъект, ПараметрыФормы);
	PEN007_МодификацияИнтерфейса.ИнициализацияЭлементаПолеHTML(ЭтотОбъект, ПараметрыФормы);

КонецПроцедуры

&НаКлиенте
Процедура PEN007_ПриОткрытииПосле(Отказ)

	конс_ПодключаемаяКонсольКлиент.ПодключитьРедактор(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти


//@skip-check module-structure-form-event-regions
//@skip-check module-unused-method
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура PEN007_HTMLДокументСформирован(Элемент)

	конс_ПодключаемаяКонсольКлиент.ОбработчикДокументСформирован(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура PEN007_HTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)

	конс_ПодключаемаяКонсольКлиент.ОбработчикПриНажатии(ЭтотОбъект, ДанныеСобытия);

КонецПроцедуры

#КонецОбласти


//@skip-check extension-method-prefix
#Область СлужебныеПроцедурыИФункции

// Возвращает имя события для записи в ЖР (на основании имен модуля и метода).
//
// Параметры:
//  ИмяМетода - Строка - Имя функции или процедуры
//
// Возвращаемое значение:
//  Строка
&НаСервере
Функция ИмяСобытия(ИмяМетода)
	Возврат СтрШаблон("%1.%2", ИмяМодуля(), ИмяМетода);
КонецФункции

&НаСервере
Функция ИмяМодуля()
	Возврат ОбъектМетаданных().Имя;
КонецФункции

&НаСервере
Функция ОбъектМетаданных()
	Возврат Метаданные.Справочники.Алгоритмы.Формы.ФормаЭлемента;
КонецФункции

#КонецОбласти