#Область ОбработчикиКомандФормы

//@skip-check module-structure-form-event-regions - команда формы создается программно, EDT не связывает ее с обработчиком
//@skip-check module-unused-method
&НаКлиенте
Процедура PEN007_ПерейтиКПравилуКонвертацииОбъекта(Команда)

	PEN007_ОбщегоНазначенияКлиент.ПерейтиКПравилуКонвертацииОбъекта(ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&После("ПриСозданииНаСервере")
&НаСервере
Процедура PEN007_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)

	PEN007_МодификацияИнтерфейса.ПОД_ФормаЭлемента_МодификацияИнтерфейса(ЭтотОбъект);

КонецПроцедуры

#КонецОбласти
