// @strict-types
#Область ПрограммныйИнтерфейс

#Область ПКС_ФормаЭдемента

// Справочник ПКС - Форма элемента - Модификация интерфейса.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - модифицируемая форма
Процедура ПКС_ФормаЭлемента_МодификацияИнтерфейса(Форма) Экспорт

	ДобавитьКнопкуПерейтиКПКО(Форма);

КонецПроцедуры

#КонецОбласти

#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьКнопкуПерейтиКПКО(Форма)

	Заголовок = "Перейти к правилу конвертации объекта";
	ИмяКоманды = "КомандаОткрытьФормуПКО";
	ПФИВызовСервера.СоздатьКоманду(Форма, ИмяКоманды, Заголовок, "PEN007_ОткрытьФормуПКО");
	
	// Кнопка PEN007_КнопкаОткрытьФормуПКО
	Родитель = Форма.Элементы.Найти("ГруппаНастройкаПравилаКонвертацииСвойства");
	Если Родитель <> Неопределено Тогда
		ЭлементПеред = Форма.Элементы.Найти("УказыватьПравилоКонвертацииСвойстваСтрокой");
		СвойстваЭлемента = Новый Структура();
		СвойстваЭлемента.Вставить("Картинка", БиблиотекаКартинок.ПереместитьВправо);
		СвойстваЭлемента.Вставить("Отображение", ОтображениеКнопки.Картинка);
		ПФИВызовСервера.Кнопка(Форма, "PEN007_КнопкаОткрытьФормуПКО", Родитель, Заголовок, "КомандаОткрытьФормуПКО", 1,
			СвойстваЭлемента, ЭлементПеред);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти