// @strict-types


//
#Область ПрограммныйИнтерфейс

#Область ПКС_ФормаЭлемента

// Справочник ПКС - Форма элемента - Модификация интерфейса.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - модифицируемая форма
Процедура ПКС_ФормаЭлемента_МодификацияИнтерфейса(Форма) Экспорт

	ДобавитьКнопкуПерейтиКПКО(Форма);

КонецПроцедуры

#КонецОбласти

#Область СправочникПКО_ФормаЭлемента

// Справочник Правила конвертации объектов - Форма элемента - Модификация интерфейса.
// Корректирует условное оформление ключевых свойств формата: в базовой форме
// используется уменьшенный полужирный шрифт, в результате чего колонка
// "Свойство формата" визуально отличается от основного оформления формы.
// Заменяет шрифт на полужирный стандартного размера формы.
//
// Параметры:
//  Форма см. Справочник.ПравилаКонвертацииОбъектов.Форма.ФормаЭлемента
Процедура ПКО_ФормаЭлемента_МодификацияИнтерфейса(Форма) Экспорт

	// Оформление шрифта для строк с ключевыми свойствами (для XDTO) и с полями поиска (XML).
	Элемент = Форма.УсловноеОформление.Элементы.Добавить();
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтыСтиля.ВажнаяНадписьШрифт);
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));

	Если Форма.ЭтоКонвертацияXDTO Тогда
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПравилаКонвертацииСвойств.ЭтоКлючевоеСвойство");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Истина;
		// Оформляемые поля: свойство формата 
		ОформляемоеПоле = Элемент.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ПравилаКонвертацииСвойствСвойствоФормата");
	Иначе
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПравилаКонвертацииСвойств.Поиск");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Истина;
		// Оформляемые поля: вся строка.
		ОформляемоеПоле = Элемент.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ПравилаКонвертацииСвойств");
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьКнопкуПерейтиКПКО(Форма)

	Заголовок = "Перейти к правилу конвертации объекта";
	ИмяКоманды = "КомандаОткрытьФормуПКО";
	ПФИВызовСервера.СоздатьКоманду(Форма, ИмяКоманды, Заголовок, "PEN007_ОткрытьФормуПКО");
	
	// Кнопка PEN007_КнопкаОткрытьФормуПКО
	Родитель = Форма.Элементы.Найти("ГруппаНастройкаПравилаКонвертацииСвойства");
	Если Родитель <> Неопределено Тогда
		ЭлементПеред = Форма.Элементы.Найти("УказыватьПравилоКонвертацииСвойстваСтрокой");
		СвойстваЭлемента = Новый Структура();
		СвойстваЭлемента.Вставить("Картинка", БиблиотекаКартинок.ПереместитьВправо);
		СвойстваЭлемента.Вставить("Отображение", ОтображениеКнопки.Картинка);
		ПФИВызовСервера.Кнопка(Форма, "PEN007_КнопкаОткрытьФормуПКО", Родитель, Заголовок, "КомандаОткрытьФормуПКО", 1,
			СвойстваЭлемента, ЭлементПеред);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти