// @strict-types
#Область ПрограммныйИнтерфейс

#Область СправочникПКС_ФормаЭлемента

// Справочник ПКС - Форма элемента - Модификация интерфейса.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - модифицируемая форма
Процедура ПКС_ФормаЭлемента_МодификацияИнтерфейса(Форма) Экспорт

	ДобавитьКнопкуПерейтиКПКО(Форма);

КонецПроцедуры

#КонецОбласти

#Область ДобавитьЭлементПолеHTML_ПриСозданииНаСервере

// Параметры формы (Интерфейс).
// 
// Возвращаемое значение:
//  Структура - Параметры формы:
// * ЭлементПеред - ЭлементыФормы, Неопределено - 
// * ЭлементГруппа - ЭлементыФормы, Неопределено - 
// * ЭлементИмя - Строка - 
// * ЭлементЗаголовок - Строка - 
Функция Интерфейс_ПараметрыФормы() Экспорт

	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ЭлементПеред", Неопределено);
	ПараметрыФормы.Вставить("ЭлементГруппа", Неопределено);
	ПараметрыФормы.Вставить("ЭлементИмя", "");
	ПараметрыФормы.Вставить("ЭлементЗаголовок", "");

	Возврат ПараметрыФормы;
КонецФункции

// Добавить элемент формы Поле HTML для поля кода.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Модифицируемая форма
//  ПараметрыФормы - см. Интерфейс_ПараметрыФормы
Процедура ДобавитьЭлементПолеHTML(Форма, ПараметрыФормы) Экспорт

	ОписаниеТипаСтрока = ПФИВызовСервера.ОписаниеТипаСтрока();
	ПФИВызовСервера.СоздатьРеквизит(Форма, ПараметрыФормы.ЭлементИмя, ОписаниеТипаСтрока);

	СобытияЭлемента = Новый Структура();
	СобытияЭлемента.Вставить("ДокументСформирован", "PEN007_HTMLДокументСформирован");
	СобытияЭлемента.Вставить("ПриНажатии", "PEN007_HTMLПриНажатии");

	ПФИВызовСервера.Поле(Форма, ПараметрыФормы.ЭлементИмя, ПараметрыФормы.ЭлементГруппа,
		ПараметрыФормы.ЭлементЗаголовок, 6, ПараметрыФормы.ЭлементИмя, , СобытияЭлемента, ПараметрыФормы.ЭлементПеред);

КонецПроцедуры

// Инициализация элемента поле HTML для поля кода.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Модифицируемая форма
//  ПараметрыФормы - см. Интерфейс_ПараметрыФормы
Процедура ИнициализацияЭлементаПолеHTML(Форма, ПараметрыФормы) Экспорт
	конс_ПодключаемаяКонсольСервер.ИнициализироватьРедактор(Форма, Форма.УникальныйИдентификатор,
		ПараметрыФормы.ЭлементИмя);
КонецПроцедуры

// Возвращает элемент формы по его наименованию.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма, в которой выполняется поиск
//  ИмяЭлемента - Строка - Имя элемента, который нужно найти на форме
// 
// Возвращаемое значение:
//  - ЭлементыФормы - найденный по наименованию элемент
//  - Неопределено - если элемент по наименованию не найден
//  
Функция ЭлементФормы(Форма, ИмяЭлемента) Экспорт

	ЭлементФормы = Форма.Элементы.Найти(ИмяЭлемента);

	Возврат ЭлементФормы;
КонецФункции

// Получить имя Элемента для отображения кода.
// 
// Параметры:
//  ИмяЭлемента - Строка - Имя элемента для отображения Кода, определенное в типовом решении (старое поле кода)
// 
// Возвращаемое значение:
//  Строка - Имя Элемента для отображения кода
Функция ЭлементИмя(ИмяЭлемента) Экспорт
	Возврат СтрШаблон("%1_%2", "PEN007", ИмяЭлемента)
КонецФункции

#КонецОбласти

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

#Область СправочникПКС_ФормаЭлемента

Процедура ДобавитьКнопкуПерейтиКПКО(Форма)

	Заголовок = "Перейти к правилу конвертации объекта";
	ИмяКоманды = "КомандаОткрытьФормуПКО";
	ПФИВызовСервера.СоздатьКоманду(Форма, ИмяКоманды, Заголовок, "PEN007_ОткрытьФормуПКО");
	
	// Кнопка PEN007_КнопкаОткрытьФормуПКО
	Родитель = Форма.Элементы.Найти("ГруппаНастройкаПравилаКонвертацииСвойства");
	Если Родитель <> Неопределено Тогда
		ЭлементПеред = Форма.Элементы.Найти("УказыватьПравилоКонвертацииСвойстваСтрокой");
		СвойстваЭлемента = Новый Структура();
		СвойстваЭлемента.Вставить("Картинка", БиблиотекаКартинок.ПереместитьВправо);
		СвойстваЭлемента.Вставить("Отображение", ОтображениеКнопки.Картинка);
		ПФИВызовСервера.Кнопка(Форма, "PEN007_КнопкаОткрытьФормуПКО", Родитель, Заголовок, "КомандаОткрытьФормуПКО", 1,
			СвойстваЭлемента, ЭлементПеред);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

// Возвращает имя события для записи в ЖР (на основании имен модуля и метода).
//
// Параметры:
//  ИмяМетода - Строка - Имя функции или процедуры
//
// Возвращаемое значение:
//  Строка
Функция ИмяСобытия(ИмяМетода)
	Возврат СтрШаблон("%1.%2", ИмяМодуля(), ИмяМетода);
КонецФункции

Функция ИмяМодуля()
	Возврат ОбъектМетаданных().Имя;
КонецФункции

Функция ОбъектМетаданных()
	Возврат Метаданные.ОбщиеМодули.PEN007_МодификацияИнтерфейса;
КонецФункции

#КонецОбласти