// @strict-types


#Область ПрограммныйИнтерфейс

Процедура ОткрытьФормуПКО(ФормаПКС) Экспорт

	Если ПустаяСтрока(ФормаПКС.ПравилоКонвертацииСвойства) Тогда
		Возврат;
	КонецЕсли;

	ТипПКО = PEN007_ОбщегоНазначенияВызовСервера.ТипПравилаКонвертацииПоСвойству(
		ФормаПКС.СвойствоКонфигурацииКорреспондента);

	СправочникСсылка = PEN007_ОбщегоНазначенияВызовСервера.СсылкаНаПКО(Объект.ПравилоКонвертацииСвойства, ТипПКО);
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Ключ", СправочникСсылка);
	ИмяФормыПравила = СтрШаблон("Справочник.%1.ФормаОбъекта", ТипПКО);
	ОткрытьФорму(ИмяФормыПравила, ПараметрыФормы, ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
