// @strict-types
#Область ПрограммныйИнтерфейс

// Открыть форму ПКО которое указано в ПКС.
// 
// Параметры:
//  ФормаПКС - ФормаКлиентскогоПриложения - открытая Форма ПКС из которой требуется открыть ПКО
Процедура ОткрытьФормуПКО(ФормаПКС) Экспорт

	Если ПустаяСтрока(ФормаПКС.Объект.ПравилоКонвертацииСвойства) Тогда
		Возврат;
	КонецЕсли;

	ТипПКО = PEN007_ОбщегоНазначенияВызовСервера.ТипПравилаКонвертацииПоСвойству(
		ФормаПКС.Объект.СвойствоКонфигурацииКорреспондента);

	Конвертация = PEN007_ОбщегоНазначенияВызовСервера.КонвертацияПоПравилу(ФормаПКС.Объект.Ссылка);

	СправочникСсылка = PEN007_ОбщегоНазначенияВызовСервера.ПравилоКонвертацииПоИдентификатору(
		ФормаПКС.Объект.ПравилоКонвертацииСвойства, Конвертация, ТипПКО);

	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Ключ", СправочникСсылка);
	ИмяФормыПравила = СтрШаблон("Справочник.%1.ФормаОбъекта", ТипПКО);
	ОткрытьФорму(ИмяФормыПравила, ПараметрыФормы, ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти