#Область ОбработчикиСобытийФормы

&НаСервере
Процедура PEN007_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)

	PEN007_МодификацияИнтерфейса.ПКС_ФормаЭлемента_МодификацияИнтерфейса(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура PEN007_ОткрытьФормуПКО(Команда)

	Если ПустаяСтрока(Объект.ПравилоКонвертацииСвойства) Тогда
		Возврат;
	КонецЕсли;

	ТипПКО = PEN007_ОбщегоНазначенияВызовСервера.ТипПравилаКонвертацииПоСвойству(
		Объект.СвойствоКонфигурацииКорреспондента);

	СправочникСсылка = PEN007_ОбщегоНазначенияВызовСервера.СсылкаНаПКО(Объект.ПравилоКонвертацииСвойства, ТипПКО);
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Ключ", СправочникСсылка);
	ИмяФормыПравила = СтрШаблон("Справочник.%1.ФормаОбъекта", ТипПКО);
	ОткрытьФорму(ИмяФормыПравила, ПараметрыФормы, ЭтотОбъект);

КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции


#КонецОбласти