#Область ОбработчикиСобытийФормы

&НаСервере
Процедура PEN007_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)

	PEN007_МодификацияИнтерфейса.ПКС_ФормаЭлемента_МодификацияИнтерфейса(ЭтотОбъект);

КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

//@skip-check module-structure-form-event-regions - обработчик программно добавленной команды формы
//@skip-check module-unused-method
&НаКлиенте
Процедура PEN007_ПерейтиКПравилуКонвертации(Команда)

	PEN007_ОбщегоНазначенияКлиент.ПерейтиКПравилуКонвертацииСвойства(ЭтотОбъект);

КонецПроцедуры

#КонецОбласти
