// @strict-types
#Область ПрограммныйИнтерфейс

// Тип правила конвертации по свойству.
// 
// Параметры:
//  Свойство - СправочникСсылка.Свойства - Свойство объекта
// 
// Возвращаемое значение:
//  Строка - Тип правила конвертации по свойству, например
//    ПравилаКонвертацииОбъектов, ПравилаКонвертацииПредопределенныхДанных
Функция ТипПравилаКонвертацииПоСвойству(Свойство) Экспорт
	Возврат PEN007_ОбщегоНазначения.ТипПравилаКонвертацииПоСвойству(Свойство);
КонецФункции

// Ссылка на правило конвертации по его наименованию.
// 
// Параметры:
//  НаименованиеПравила - Строка - Наименование правила конвертации
//  ТипПКО - Строка - Тип ПКО, см. ТипПравилаКонвертацииПоСвойству
// 
// Возвращаемое значение:
//  - СправочникСсылка.ПравилаКонвертацииОбъектов
//  - СправочникСсылка.ПравилаКонвертацииПредопределенныхДанных - Ссылка на правило конвртации
Функция СсылкаНаПКО(НаименованиеПравила, ТипПКО) Экспорт
	
	МенеджерСправочника = Справочники[ТипПКО];
	СсылкаНаПКО = МенеджерСправочника.НайтиПоКоду(НаименованиеПравила);
	
	Возврат СсылкаНаПКО;
КонецФункции


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти