// @strict-types
#Область ПрограммныйИнтерфейс

// Тип правила конвертации по свойству конвертируемого объекта.
// 
// Параметры:
//  Свойство - СправочникСсылка.Свойства - Свойство объекта
// 
// Возвращаемое значение:
//  Строка - Тип правила конвертации по свойству, например
//    ПравилаКонвертацииОбъектов, ПравилаКонвертацииПредопределенныхДанных
Функция ТипПравилаКонвертацииПоСвойству(Свойство) Экспорт

	ТипПравилаКонвертации = "";

	ТипыСтрокой = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Свойство, "ТипыСтрокой");
	Если СтрНайти(НРег(ТипыСтрокой), НРег("ПеречислениеСсылка")) > 0 Тогда
		ТипПравилаКонвертации = "ПравилаКонвертацииПредопределенныхДанных";
	Иначе
		ТипПравилаКонвертации = "ПравилаКонвертацииОбъектов";
	КонецЕсли;

	Возврат ТипПравилаКонвертации;
КонецФункции

// Ссылка на правило конвертации (ПКО, ПКПД)  по его наименованию.
// 
// Параметры:
//  НаименованиеПравила - Строка - Наименование правила конвертации
//  ТипПравила - Строка - Тип ПКО, см. ТипПравилаКонвертацииПоСвойству
// 
// Возвращаемое значение:
//  - СправочникСсылка.ПравилаКонвертацииОбъектов
//  - СправочникСсылка.ПравилаКонвертацииПредопределенныхДанных 
//  - Неопределено - Ссылка на правило конвртации или Неопределено, если не найдено
Функция СсылкаНаПКО(ПКИдентификатор, ТипПравила) Экспорт

	Правило = Неопределено;
	
	Конвертация = КонвертацияПоПравилу()

	Возврат СсылкаНаПКО;
КонецФункции
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Ссылка на конвертацию, которая определена по правилу ПКС или ПКО.
// 
// Параметры:
//  ПравилоКонвертации 	- СправочникСсылка.ПравилаКонвертацииОбъектов -
//    					- СправочникСсылка.ПравилаКонвертацииСвойств - 
//    					- СправочникСсылка.ПравилаОбработкиДанных - 
//    					- СправочникСсылка.ПравилаКонвертацииПредопределенныхДанных - 
// 
// Возвращаемое значение:
//  СправочникСсылка.Конвертации - ссылка на конвертацию, которая определена по правилу
Функция КонвертацияПоПравилу(ПравилоКонвертации)

	Конвертация = Справочники.Конвертации.ПустаяСсылка();

	Если ТипЗнч(ПравилоКонвертации) = Тип("СправочникСсылка.ПравилаКонвертацииСвойств") Тогда
		Владелец = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПравилоКонвертации, "Владелец");
		ПКСсылка = Владелец;
	Иначе
		ПКСсылка = ПравилоКонвертации;
	КонецЕсли;

	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
				   |	Составы.Владелец КАК Конвертация
				   |ИЗ
				   |	Справочник.СоставыКонвертаций КАК Составы
				   |ГДЕ
				   |	Составы.ЭлементКонвертации = &ПКСсылка";

	Запрос.УстановитьПараметр("ПКСсылка", ПКСсылка);

	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаЗапроса = РезультатЗапроса.Выбрать();
		ВыборкаЗапроса.Следующий();
		Конвертация = ВыборкаЗапроса.Конвертация;
	КонецЕсли;

	Возврат Конвертация;
КонецФункции

// Ссылка на правило конвертации ПКО или ПКПД конкретной конвертации по идентификатору правила.
// 
// Параметры:
//  ПКИдентификатор - Строка - Идентификатор правила ПКО или ПКПД (реквизит Код)
//  Конвертация - СправочникСсылка.Конвертации - Конвертация
//  ТипПравила - Строка - Тип правила конвертации, например
//    ПравилаКонвертацииОбъектов,
//    ПравилаКонвертацииПредопределенныхДанных
// 
// Возвращаемое значение:
//  - СправочникСсылка.ПравилаКонвертацииОбъектов, 
//  - СправочникСсылка.ПравилаКонвертацииПредопределенныхДанных 
//  - Неопределено - Ссылка на правило конкретной конвертации по идентификатору правила или неопределено, если не найдено
Функция ПравилоКонвертацииПоИдентификатору(ПКИдентификатор, Конвертация, ТипПравила)

	Правило = Неопределено;

	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
				   |	Составы.ЭлементКонвертации КАК Правило
				   |ИЗ
				   |	Справочник.СоставыКонвертаций КАК Составы
				   |ГДЕ
				   |	Составы.Владелец = &Конвертация
				   |	И ВЫБОР
				   |		КОГДА &ТипПравила = ""ПравилаКонвертацииОбъектов""
				   |			ТОГДА Составы.ЭлементКонвертации ССЫЛКА Справочник.ПравилаКонвертацииОбъектов
				   |		ИНАЧЕ Составы.ЭлементКонвертации ССЫЛКА Справочник.ПравилаКонвертацииПредопределенныхДанных
				   |	КОНЕЦ
				   |	И Составы.ЭлементКонвертации.Код = &ПКОИдентификатор";

	Запрос.УстановитьПараметр("Конвертация", Конвертация);
	Запрос.УстановитьПараметр("ПКОИдентификатор", ПКИдентификатор);

	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаЗапроса = РезультатЗапроса.Выбрать();
		ВыборкаЗапроса.Следующий();
		Правило = ВыборкаЗапроса.Правило;
	КонецЕсли;

	Возврат Правило;
КонецФункции

#КонецОбласти